[
  {
    "description": [
      "<p>NEW CHARACTER CLASS</p>",
      "<p>Necromancer</p>",
      "<table><tr><th></th><th><strong>Exp.</strong></th><th></th><th><strong>Spells</strong></th></tr><tr><td><strong>Level</strong></td><td><strong>Points</strong></td><td><strong>Hit Dice</strong></td><td><strong>1</strong></td><td><strong>2</strong></td><td><strong>3</strong></td><td><strong>4</strong></td><td><strong>5</strong></td><td><strong>6</strong></td></tr><tr><td>1</td><td>0</td><td>1d4</td><td>1</td><td>-</td><td>-</td><td>-</td><td>-</td><td>-</td></tr><tr><td>2</td><td>2,500</td><td>2d4</td><td>2</td><td>-</td><td>-</td><td>-</td><td>-</td><td>-</td></tr><tr><td>3</td><td>5,000</td><td>3d4</td><td>2</td><td>1</td><td>-</td><td>-</td><td>-</td><td>-</td></tr><tr><td>4</td><td>10,000</td><td>4d4</td><td>2</td><td>2</td><td>-</td><td>-</td><td>-</td><td>-</td></tr><tr><td>5</td><td>20,000</td><td>5d4</td><td>2</td><td>2</td><td>1</td><td>-</td><td>-</td><td>-</td></tr><tr><td>6</td><td>40,000</td><td>6d4</td><td>3</td><td>2</td><td>2</td><td>-</td><td>-</td><td>-</td></tr><tr><td>7</td><td>80,000</td><td>7d4</td><td>3</td><td>2</td><td>2</td><td>1</td><td>-</td><td>-</td></tr><tr><td>8</td><td>150,000</td><td>8d4</td><td>3</td><td>3</td><td>2</td><td>2</td><td>-</td><td>-</td></tr><tr><td>9</td><td>300,000</td><td>9d4</td><td>3</td><td>3</td><td>2</td><td>2</td><td>1</td><td>-</td></tr><tr><td>10</td><td>450,000</td><td>9d4+1</td><td>4</td><td>3</td><td>3</td><td>2</td><td>2</td><td>-</td></tr><tr><td>11</td><td>600,000</td><td>9d4+2</td><td>4</td><td>4</td><td>3</td><td>2</td><td>2</td><td>1</td></tr><tr><td>12</td><td>750,000</td><td>9d4+3</td><td>4</td><td>4</td><td>3</td><td>3</td><td>2</td><td>2</td></tr><tr><td>13</td><td>900,000</td><td>9d4+4</td><td>4</td><td>4</td><td>4</td><td>3</td><td>2</td><td>2</td></tr><tr><td>14</td><td>1,050,000</td><td>9d4+5</td><td>4</td><td>4</td><td>4</td><td>3</td><td>3</td><td>2</td></tr><tr><td>15</td><td>1,200,000</td><td>9d4+6</td><td>5</td><td>4</td><td>4</td><td>3</td><td>3</td><td>2</td></tr><tr><td>16</td><td>1,350,000</td><td>9d4+7</td><td>5</td><td>5</td><td>4</td><td>3</td><td>3</td><td>2</td></tr><tr><td>17</td><td>1,500,000</td><td>9d4+8</td><td>5</td><td>5</td><td>4</td><td>4</td><td>3</td><td>3</td></tr><tr><td>18</td><td>1,650,000</td><td>9d4+9</td><td>6</td><td>5</td><td>4</td><td>4</td><td>3</td><td>3</td></tr><tr><td>19</td><td>1,800,000</td><td>9d4+10</td><td>6</td><td>5</td><td>5</td><td>4</td><td>3</td><td>3</td></tr><tr><td>20</td><td>1,950,000</td><td>9d4+11</td><td>6</td><td>5</td><td>5</td><td>4</td><td>4</td><td>3</td></tr></table>",
      "<p>Necromancers are Magic-Users who practice necromancy, seeking expertise of the darker side of the arcane. Necromancers are rare due to the unsavory nature of their profession, often living in proximity to graveyards, burial mounds, and other places associated with the dead. They are sometimes known by other terms such as Bokor or even Death Master. Regardless of what they are called or the culture they come from, they share certain traits.</p>",
      "<p>Necromancers are poor fighters, with fighting ability equivalent to normal Magic-Users. Likewise they are no more hardy than standard Magic-Users (d4 hit die). They may not wear armor of any sort or use shields, but unlike other Magic-Users they have expanded weapon choices. In addition to the dagger and walking staff, Necromancers can use sickles, scythes, spades, and scimitars (see New Equipment below), and they can likewise use magical weapons of those types. Otherwise, Necromancers can generally be treated as equivalent to Magic-Users for any situation not covered here.</p>",
      "<p>The Prime Requisite for Necromancers is Intelligence. In addition to requiring an Intelligence score of 11 or higher, a Necromancer also must have a Wisdom score of at least 9 in order to qualify for the rigors of the class. Although not a requirement, most Necromancers do not score high in looks or Charisma. The class generally attracts those who are persecuted or otherwise disenfranchised with normal society.</p>",
      "<p>Necromancers produce magic much like other types of Magic-Users, but have different spell choices. They can learn spells from each other so long as the spells are available to both classes. Like other Magic-Users, a first-level Necromancer begins play knowing read magic and one other spell of first level, recorded within a spellbook. The GM may roll for the spell, assign it as they see fit, or allow the player to choose it, at their option. See the Necromancer Spells section for more details.</p>",
      "<p>NEW EQUIPMENT</p>",
      "<table><tr><th><strong>New Weapons</strong></th><th><strong>Cost</strong></th><th><strong>Size</strong></th><th><strong>Wt.</strong></th><th><strong>Dmg.</strong></th></tr><tr><td>Sickle</td><td>2 gp</td><td>S</td><td>2</td><td>1d6</td></tr><tr><td>Spade</td><td>2 gp</td><td>M</td><td>4</td><td>1d6</td></tr><tr><td>Scimitar (longsword)</td><td>10 gp</td><td>M</td><td>4</td><td>1d8</td></tr><tr><td>Scythe (2 handed weapon)</td><td>7 gp</td><td>L</td><td>10</td><td>1d8</td></tr></table>",
      "<p>SPELLS</p>",
      "<p>Below are listed spells available to the Necromancer subclass. Spells in bold are new to this supplement. Spells with an asterisk (*) following the name are reversible.</p>",
      "<p>Necromancer Spells</p>",
      "<p>First Level Necromancer Spells</p>",
      "<table><tr><th>1</th><th><strong>Call Poltergeist</strong></th></tr><tr><td>2</td><td><strong>Chill</strong></td></tr><tr><td>3</td><td><strong>Corpse Servant</strong></td></tr><tr><td>4</td><td><strong>Decay Flesh*</strong></td></tr><tr><td>5</td><td>Detect Magic</td></tr><tr><td>6</td><td>Light*</td></tr><tr><td>7</td><td><strong>Locate Corpse</strong></td></tr><tr><td>8</td><td><strong>Protection from Undead*</strong></td></tr><tr><td>9</td><td>Read Languages</td></tr><tr><td>10</td><td>Remove Fear*</td></tr><tr><td>11</td><td><strong>Stench</strong></td></tr><tr><td>12</td><td>Ventriloquism</td></tr></table>",
      "<p>Second Level Necromancer Spells</p>",
      "<table><tr><th>1</th><th><strong>Boneskin</strong></th></tr><tr><td>2</td><td><strong>Command Undead</strong></td></tr><tr><td>3</td><td>Continual Light*</td></tr><tr><td>4</td><td>Detect Invisible</td></tr><tr><td>5</td><td><strong>Fireskull Familiar</strong></td></tr><tr><td>6</td><td><strong>Ghoulish Hands</strong></td></tr><tr><td>7</td><td>Invisibility</td></tr><tr><td>8</td><td>Knock</td></tr><tr><td>9</td><td>Locate Object</td></tr><tr><td>10</td><td><strong>Maggot Spray</strong></td></tr><tr><td>11</td><td><strong>Minor Warding</strong></td></tr><tr><td>12</td><td>Wizard Lock</td></tr></table>",
      "<p>Third Level Necromancer Spells</p>",
      "<table><tr><th>1</th><th>Darkvision</th></tr><tr><td>2</td><td>Dispel Magic</td></tr><tr><td>3</td><td><strong>Drainblade</strong></td></tr><tr><td>4</td><td><strong>Ectoplasm</strong></td></tr><tr><td>5</td><td><strong>Fossilize</strong></td></tr><tr><td>6</td><td><strong>Halt Undead</strong></td></tr><tr><td>7</td><td><strong>Protection from Undead, 10' Radius*</strong></td></tr><tr><td>8</td><td><strong>Ray of Exhaustion</strong></td></tr><tr><td>9</td><td>Speak with Dead</td></tr><tr><td>10</td><td><strong>Spirit Wrack</strong></td></tr><tr><td>11</td><td><strong>Summon Spirit</strong></td></tr><tr><td>12</td><td><strong>Vampiric Touch</strong></td></tr></table>",
      "<p>Fourth Level Necromancer Spells</p>",
      "<table><tr><th>1</th><th><strong>Black Tentacles</strong></th></tr><tr><td>2</td><td><strong>Corpse Feast</strong></td></tr><tr><td>3</td><td>Cure Disease*</td></tr><tr><td>4</td><td>Dimension Door</td></tr><tr><td>5</td><td><strong>Enervation</strong></td></tr><tr><td>6</td><td><strong>Grave Sanctuary</strong></td></tr><tr><td>7</td><td><strong>Greater Fear</strong></td></tr><tr><td>8</td><td><strong>Re-Animation</strong></td></tr><tr><td>9</td><td>Remove Curse*</td></tr><tr><td>10</td><td><strong>Rot Flesh</strong></td></tr><tr><td>11</td><td><strong>Wall of Bones</strong></td></tr><tr><td>12</td><td>Wizard Eye</td></tr></table>",
      "<p>Fifth Level Necromancer Spells</p>",
      "<table><tr><th>1</th><th><strong>Blight</strong></th></tr><tr><td>2</td><td>Cloudkill</td></tr><tr><td>3</td><td>Magic Jar</td></tr><tr><td>4</td><td><strong>Mask of Life</strong></td></tr><tr><td>5</td><td><strong>Mummify</strong></td></tr><tr><td>6</td><td>Passwall</td></tr><tr><td>7</td><td><strong>Symbol of Pain</strong></td></tr><tr><td>8</td><td>Wall of Stone</td></tr><tr><td>9</td><td><strong>Waves of Fatigue</strong></td></tr><tr><td>10</td><td>Word of Recall</td></tr></table>",
      "<p>Sixth Level Necromancer Spells</p>",
      "<table><tr><th>1</th><th>Anti-Magic Shell</th></tr><tr><td>2</td><td><strong>Control Undead</strong></td></tr><tr><td>3</td><td>Death Spell</td></tr><tr><td>4</td><td>Disintegrate</td></tr><tr><td>5</td><td><strong>Eyebite</strong></td></tr><tr><td>6</td><td>Projected Image</td></tr><tr><td>7</td><td><strong>Symbol of Fear</strong></td></tr><tr><td>8</td><td><strong>Undeath</strong></td></tr><tr><td>9</td><td><strong>Undeath to Death</strong></td></tr><tr><td>10</td><td>Wall of Iron</td></tr></table>",
      "<p>A field of 10-foot-long rubbery tentacles will spring from the ground. The area is up to 30 by 30 feet, and they will appear from whatever surface is present, including water.</p>",
      "<p>The tentacles will attack any creature in the area with the intent to wrestle them (see the wrestling rules in the Basic Fantasy RPG Core Rules). They attack with the caster’s attack bonus and are considered to have a Strength of 18. There are more than enough tentacles to individually attack as many targets as can be present. If the attack succeeds, the target is held immobile and takes 1d6 points of damage each round it is held.</p>",
      "<p>Any creature that is not held by a tentacle may still only move through the affected area at half speed.</p>"
    ],
    "range": "100' + 10' / level",
    "name": "Black Tentacles",
    "duration": "1 round / level",
    "level": 4,
    "class": "Necromancer"
  },
  {
    "range": "touch",
    "name": "Blight",
    "duration": "instantaneous",
    "level": 5,
    "class": "Necromancer",
    "description": [
      "<p>This spell withers a single plant of any size. It causes 1d6 points of damage per level of the caster to the touched plant creature. The creature is allowed a save vs. Spells for half damage. If the plant is not a creature, it immediately withers and dies with no saving throw.</p>",
      "<p>Only the touched plant is affected; the spell has no effect on anything else in the area.</p>"
    ]
  },
  {
    "range": "self",
    "name": "Boneskin",
    "duration": "1 turn / level",
    "level": 2,
    "class": "Necromancer",
    "description": [
      "<p>Protects the caster; the caster manifests a chitinous bone-like armor, giving the caster a +4 bonus to AC. No actual bulk is added to the caster, so it doesn’t affect other spell-casting.</p>"
    ]
  },
  {
    "range": "5' / level",
    "name": "Call Poltergeist",
    "duration": "1 hour / level",
    "level": 1,
    "class": "Necromancer",
    "description": [
      "<p>This spell binds a minor spirit to an area. The poltergeist is an invisible, shapeless force that performs simple tasks at the Necromancer’s command. A poltergeist can run and fetch things, open unstuck doors, and hold chairs, as well as clean and mend. The poltergeist can perform only one activity at a time, but it repeats the same activity over and over again if told to do so as long as the Necromancer remains within range. A poltergeist can only open normal doors, drawers, lids, and the like, having an effective Strength score of 3. The poltergeist can trigger traps and such, but it can exert only 20 pounds of force, which may not be enough to activate certain pressure plates and other devices.</p>"
    ]
  },
  {
    "range": "10'",
    "name": "Chill",
    "duration": "2 rounds",
    "level": 1,
    "class": "Necromancer",
    "description": [
      "<p>This spell does 1d4 points of damage to one creature within range. Furthermore, the creature must save vs. Paralysis or suffer -1 to melee hit and damage rolls for 1d6 rounds. A large heat source nearby gives a +2 to save. The caster may use this spell on one target up to 2 rounds after casting.</p>"
    ]
  },
  {
    "range": "30'",
    "name": "Command Undead",
    "duration": "special",
    "level": 2,
    "class": "Necromancer",
    "description": [
      "<p>This spell allows the caster to influence an undead creature. If the undead creature is intelligent, this spell operates as charm person, except that the caster can influence 2 HD per caster level, instead of just a flat 4 HD. It otherwise operates the same, including duration.</p>",
      "<p>If the undead creature is unintelligent, the caster immediately gains complete control, the creature gets no saving throw, and the duration is permanent. Any unintelligent undead controlled using this spell count against the total control limit from re-animation.</p>"
    ]
  },
  {
    "range": "60'",
    "name": "Control Undead",
    "duration": "6 rounds / level",
    "level": 6,
    "class": "Necromancer",
    "description": [
      "<p>This spell allows for complete control of up to 3 HD/caster level of undead for a short period of time. Verbal control is required, but they will understand regardless of the language used. If communication is not possible, they will still not attack. Intelligent undead creatures may save vs. Spells to resist and will remember if they are controlled. Unintelligent undead do not get a saving throw and the control is permanent. Any unintelligent undead controlled using this spell count against the total control limit from re-animation.</p>"
    ]
  },
  {
    "range": "5' / level",
    "name": "Corpse Feast",
    "duration": "instantaneous",
    "level": 4,
    "class": "Necromancer",
    "description": [
      "<p>This spell heals the caster and nearby active undead beings by draining the last energies from any fresh corpses (no more than an hour old) within the spell range. The corpse must have been a living sentient being (i.e. not animal, undead, construct, elemental, etc). Any corpse drained using this spell provides vigor to the caster and their active undead allies within range, healing 1d4 hit points per corpse, up to their maximum. Slain or destroyed undead do not heal or rise anew. Any corpses consumed by this spell cannot be raised or resurrected by any means, even a wish. </p>"
    ]
  },
  {
    "range": "touch",
    "name": "Corpse Servant",
    "duration": "1 hour / level",
    "level": 1,
    "class": "Necromancer",
    "description": [
      "<p>This spell allows the caster to temporarily animate skeletons or zombies. A number of hit dice equal to the caster's level may be animated for up to one hour per caster level. These non-permanent undead do not count towards the re-animation spell limitations, but they otherwise conform to the permanent undead created by that spell. Only one instance of this spell may be active at a time for any particular caster.</p>",
      "<p>Animated skeletons have hit dice equal to the number the creature had in life; for skeletons of humans or demi-humans, this means one hit die, regardless of the character level of the deceased. Zombies have one more hit die than the creature had in life. An animated skeleton can be created only from a mostly intact skeleton; a zombie can be created only from a mostly intact corpse. The caster must touch the remains to be animated.</p>"
    ]
  },
  {
    "range": "touch",
    "name": "Decay Flesh",
    "duration": "instantaneous",
    "level": 1,
    "class": "Necromancer",
    "description": [
      "<p>This is a version of the cause light wounds spell (the reverse of cure light wounds), dealing 1d6+1 points of damage to the creature affected by it. The caster must make a successful attack to inflict the damage. A missed attack roll does not dispel the effect, as it can be active until used or until a number of rounds equal to the caster's level have passed.</p>",
      "<p>Unlike the Clerical spell mentioned, this spell may not be reversed. However, this spell does work upon undead creatures in the opposite fashion; they are healed 1d6+1 hit points instead.</p>"
    ]
  },
  {
    "range": "touch",
    "name": "Drainblade",
    "duration": "1 round / level",
    "level": 3,
    "class": "Necromancer",
    "description": [
      "<p>This spell imbues an edged weapon with the ability to drain blood with each successful strike made against a living creature. When a living creature is hit by a drainbladed weapon, the target suffers 1 additional point of damage. If the wielder of the weapon is injured, the extra point of damage is transferred to them as healing energy. This healing energy cannot grant more hit points than the wielder's normal maximum. For every five levels of the caster, this damage (and healing) is increased an additional point.</p>",
      "<p>Against nonliving creatures, such as undead, golems, living statues, etc, this spell has no effect.</p>"
    ]
  },
  {
    "range": "touch",
    "name": "Ectoplasm",
    "duration": "1 turn / level",
    "level": 3,
    "class": "Necromancer",
    "description": [
      "<p>When cast upon a willing intelligent creature, this spell grants the being the ability to become semi-transparent and immaterial. While in this ectoplasmic state, magical weapons or weapons with certain special properties are necessary to strike the recipient. Any stealth checks such as Move Silently or Hide are made at +20%, and the character may move through materials up to 1 inch thick per level of the caster. Some materials may prevent passage such as lead, gold, or other materials with special properties (as determined by the GM). While able to move through materials and effectively weightless, the ectoplasmic being does not gain any other special movement modes like flying or levitation; walking upon materials such as water is possible though.</p>",
      "<p>The character in an ectoplasmic state may not make physical attacks but may cast spells that do not require physical contact. While the spell is active, the individual may choose to revert back and forth between corporeal and incorporeal forms on their turn, remaining in the chosen state until their next turn. The spell cannot be cast upon on an unwilling individual and fails completely if attempted. Likewise, unintelligent or animal intelligence creatures do not possess understanding of changing their physical state, so the spell is wasted on them.</p>"
    ]
  },
  {
    "range": "50'",
    "name": "Enervation",
    "duration": "instantaneous",
    "level": 4,
    "class": "Necromancer",
    "description": [
      "<p>The caster points a finger at their intended target and rolls a ranged attack roll against the target that ignores armor (but not any Dexterity bonus). If the narrow ray of crackling black energy hits, the target suffers 1d4 negative levels and all of the effects described in Energy Drain in the Basic Fantasy RPG Core Rules. There is no saving throw, only the attack roll.</p>",
      "<p>If the target survives, it will lose the negative levels (i.e. regain their levels) after a number of hours equal to the caster’s level.</p>",
      "<p>An undead creature struck by the ray gains 5d4 temporary hit points for one hour.</p>"
    ]
  },
  {
    "range": "60'",
    "name": "Eyebite",
    "duration": "1 round / 3 levels",
    "level": 6,
    "class": "Necromancer",
    "description": [
      "<p>Each round the caster may target a single living creature for the duration of the spell. The affected creature suffers effects depending on its total hit dice. If the target has 10 HD or more, it is sickened. If the target has 5 HD through 9 HD, it is panicked and sickened. If the target has 4 HD or fewer, it is comatose, panicked, and sickened. The effects are cumulative and concurrent. Targeting each additional creature after the first requires an action, and only one may be targeted in a given round.</p>",
      "<p>The target must save vs. Death Ray to avoid the worst effect of the spell. If the target is affected by more than one effect, the remaining effects are still present.</p>",
      "<p>If a creature is sickened, it suffers from a -2 modifier for attack rolls, damage rolls, and saving throws. This effect lasts for 1 turn per caster level.</p>",
      "<p>If a creature is panicked, it will flee for 1d4 rounds. After that, the victim will flee again for 1d4 rounds if it can still see the caster. Even after the fleeing ends, the creature is still affected by the sickening as described above.</p>",
      "<p>If a creature is comatose, it falls into a coma for 1 turn per caster level. During this time, the victim cannot be awakened by any means short of dispelling the effect. Even if the coma is dispelled, the creature is still subject to fleeing if the caster is visible, and is still sickened. This is not a sleep effect.</p>"
    ]
  },
  {
    "range": "touch",
    "name": "Fireskull Familiar",
    "duration": "1 hour / level",
    "level": 2,
    "class": "Necromancer",
    "description": [
      "<p>This spell animates a single skull to serve the Necromancer. Wrapped in cold magical flames and gifted with a form of levitation-based flight, the flaming skull can fetch small items, convey messages, or other similar tasks for the Necromancer. When not tasked with a specific duty, the fireskull familiar generally hovers near its master, providing light equal to torchlight. A Necromancer may have only one instance of this spell active at a time. Subsequent castings have no effect unless the first instance of the spell is dismissed or destroyed.</p>",
      "<p>The fireskull familiar is not designed for combat, having hit points equal to 25% of the Necromancer's total hit points. The skull has an Armor Class of 13 and only a single attack for 1d2 points of damage, attacking with the same basic chance to hit as the Necromancer. The skull can be charged with spells that must be delivered by touch, with the spell effect being available to the skull on the following round. While a fireskull familiar is within 5 feet, the caster's chance of being surprised is reduced by 1.</p>",
      "<p>Of interesting note, although each skull does not remember any details of its former life, it does retain many personality traits, making each skull distinct from the next. Practitioners of this spell often have favorite skulls that they use regularly, and skulls that they are loathe to animate. Any particular skull that is destroyed through damage may never again be used.</p>"
    ]
  },
  {
    "range": "touch",
    "name": "Fossilize",
    "duration": "permanent",
    "level": 3,
    "class": "Necromancer",
    "description": [
      "<p>This spell permanently hardens the bones of one skeletal undead creature, making the bones denser and stronger. The fossilized skeleton permanently gets +2 on damage rolls, +4 on its AC, and its damage resistance is enhanced. A fossilized skeleton takes only quarter-damage from edged weapons, and half-damage from any other weapons. The fossilized skeleton becomes immune to normal arrows, bolts, and bullets. Magical missile weapons do only their 'plus' in damage.</p>",
      "<p>While this spell is permanent, there is a drawback. The newly-fossilized skeleton may not be repaired or otherwise 'healed', as the organic materials that made up the bones has been completely replaced by minerals. Intelligent skeletal undead would not normally want this spell applied to themselves, but the spell would affect them nevertheless.</p>"
    ]
  },
  {
    "range": "touch",
    "name": "Ghoulish Hands",
    "duration": "1 round / level",
    "level": 2,
    "class": "Necromancer",
    "description": [
      "<p>This spell causes the hands of one living creature to become like the horrible claws of ghouls. The bearer of these ghoulish hands may make two claw attacks that cause 1d4 points of damage each. If the recipient of this spell already had better claw attacks, then they gain a +2 damage bonus to their damage rolls while this spell is in effect. In addition to the damage, those struck by the hands must save vs. Paralysis or be paralyzed for 2d8 turns (elves are immune), exactly like the attacks of a ghoul.</p>",
      "<p>Recipients of this spell must be true living creatures; other creatures such as undead, constructs, elementals, and the like are immune. There is a 1% non-cumulative chance that on any particular casting of this spell that the recipient is actually infected with ghoul fever (per the monster description), which if proper curative steps are not taken, may ultimately result in the recipient's death and rising as an actual ghoul.</p>"
    ]
  },
  {
    "range": "touch",
    "name": "Grave Sanctuary",
    "duration": "1 turn / level",
    "level": 4,
    "class": "Necromancer",
    "description": [
      "<p>Similar to the Druid spell tree sanctuary, this spell enables the caster to create an invisible entry into a grave, mausoleum, sarcophagus, large tombstone, or similar item associated with the repose of the dead. The entry is visible to undead and other Necromancers, but this does not grant any special access to the doorway. Once the spell is complete, the Necromancer may enter the space, effectively disappearing from sight. Only one grave may be effected by grave sanctuary at a time.</p>",
      "<p>The Necromancer is completely aware of their surroundings while in the grave, gaining the bonus of 360-degree vision and hearing, as well as being able to detect changes in the immediate temperature surrounding the site. Another benefit of this spell is that each turn the Necromancer rests inside the grave counts as a full hour of sleep, so the Necromancer may meditate to memorize spells while within the magical sanctuary. Also, if the grave site is on unhallowed ground or an area otherwise associated with hauntings and the like, then the Necromancer heals 1d4 HP per turn spent inside the grave.</p>",
      "<p>While inside the grave, the Necromancer does lose any sense of taste, smell, or touch, and may not speak or otherwise cast spells while inside the grave's protection. If the grave itself is unearthed or broken into in some way, then the Necromancer takes 2d10 points of damage and is cast out into the nearest available space. This kind of undertaking should be roughly equivalent to actually digging a grave up, and not simply an attack against the earth.</p>"
    ]
  },
  {
    "range": "30'",
    "name": "Greater Fear",
    "duration": "1 round / level",
    "level": 4,
    "class": "Necromancer",
    "description": [
      "<p>This spell sends an invisible wave of fear out forward of the caster to a range of 30 feet. Anyone in the area must save vs. Spells or be panicked. A panicked creature will drop whatever it is holding and flee using any means necessary. If cornered, the creature will cower in fear. The victim will also suffer a -2 to all saving throws. The creature will do this for the duration of the spell. If a save is made, the victim is still shaken and suffers -2 to attack rolls and saving throws for 1 round.</p>"
    ]
  },
  {
    "range": "200'",
    "name": "Halt Undead",
    "duration": "1 round / level",
    "level": 3,
    "class": "Necromancer",
    "description": [
      "<p>This spell will render up to three undead creatures immobile for the duration of the spell (similar to hold person, but only affecting undead and potentially affecting more than one target). Intelligent undead get a save vs. Spells to avoid; unintelligent undead get no saving throw.</p>"
    ]
  },
  {
    "range": "360'",
    "name": "Locate Corpse",
    "duration": "1 round / level",
    "level": 1,
    "class": "Necromancer",
    "description": [
      "<p>This spell allows the caster to sense the direction of the closest corpse or remains of a type usable for spells such as re-animation or other similar spells. Throughout the duration, the caster need simply concentrate on the general type of corpse (animal, humanoid, large size, etc) and of applicable state (intact, fresh, skeletal, etc). The nearest remains fitting the criteria is located if more than one is within range. Upon arrival at the location of the nearest corpse, the caster can again concentrate to locate another corpse, as long as the spell duration lasts. Specific remains belonging to a particular individual can be located with this spell, so long as the caster knew the individual personally during life. This spell is blocked by even a thin sheet of lead or gold. Creatures, whether living or in states of undeath, cannot be found by this spell.</p>"
    ]
  },
  {
    "range": "10'",
    "name": "Maggot Spray",
    "duration": "1 round / level",
    "level": 2,
    "class": "Necromancer",
    "description": [
      "<p>From the caster’s mouth sprays a stream of filth containing live flesh-eating maggots, affecting all within a 10-foot section immediately adjacent to and chosen by the caster. Those struck by the spray must save or be sickened for 2d6 rounds (like the stench spell, causing a penalty of -2 to their attacks). Additionally, the maggots eat into the flesh, causing 1d4 points of damage immediately and on subsequent rounds an additional 1d4 points of damage per round for a number of rounds equal to the caster's level. Individuals may stop the damage by using an entire round to brush off the maggots (no movement, attacks, and loss of any Dexterity or shield bonuses during this round). Those taking the time to brush off the maggots take normal damage that round. Removing the maggots does not remove the sickening effect of those who failed their save.</p>"
    ]
  },
  {
    "range": "touch",
    "name": "Mask of Life",
    "duration": "1 hour / level",
    "level": 5,
    "class": "Necromancer",
    "description": [
      "<p>This spell makes a single undead creature appear to be alive. The caster can decide which race and style of clothes is worn by an undead creature. The spell will also make the target’s movements appear life-like. The illusion will create appropriate ambient effects (smells, sounds, clothing textures, and such) that would be expected for the life-like appearance. If the appearance is that of a living version of the target, anyone interacting with the target takes a -5 penalty to any saving throw to disbelieve the illusion. If the target attacks or does anything that only the undead creature could do, the penalty is removed.</p>"
    ]
  },
  {
    "range": "touch",
    "name": "Minor Warding",
    "duration": "special",
    "level": 2,
    "class": "Necromancer",
    "description": [
      "<p>This spell cloaks an object of less than 10 cubic feet with an invisible aura of harmful energy. Thereafter, the first living creature touching the object sets off the ward, receiving 3d6 points of damage; no saving throw is allowed to avoid the damage. The object is unaffected by the discharge of the minor ward.</p>",
      "<p>Non-living creatures such as undead or golems will not set off a minor ward. The caster is free to handle the object at will. The maximum duration of the spell is 1 hour per level of the caster.</p>"
    ]
  },
  {
    "range": "touch",
    "name": "Mummify",
    "duration": "permanent",
    "level": 5,
    "class": "Necromancer",
    "description": [
      "<p>After careful ceremonial preparations lasting five days, and the application of many rare and expensive unguents, the caster is able to call back the spirit of the dead to reanimate its corpse as a mummy. Mummies so created are of the standard sort (see its monster entry). Mummies do not count against the normal limits of controllable undead (per re-animation spell), but the caster can maintain control over as many Hit Dice of mummies as their own level.</p>",
      "<p>Mummies do not travel well, being slow and quickly wear down, taking damage on long journeys. They make better guardians for the animator's lair. A separate casting of the spell is necessary for each mummy created. It might be possible to create a mummy from a large humanoid such as a giant, however the difficulty will be greater (the GM determines how much more difficult). More powerful mummies, such as those with intact class-based powers, are generally created through the use of the undeath spell.</p>",
      "<p>Mummification is generally in the realm of the Necromancer, but occasionally Clerics of certain cults might have access as well.</p>"
    ]
  },
  {
    "name": "Protection from Undead*",
    "range": "touch",
    "level": 1,
    "class": "Necromancer",
    "duration": "1 turn / level",
    "description": [
      "<p>This spell works almost identically to the protection from evil spell by warding a creature from attacks by undead creatures, from mental control, and from summoned creatures regardless of any moral or ethical leanings. It creates a magical barrier around the subject at a distance of 1 foot. The barrier moves with the subject and has three major effects:</p>",
      "<p>First, the subject gains a +2 bonus to AC and on saves. Both of these bonuses apply against attacks made or effects created by undead creatures or beings that the GM decides have a strong connection with death or undead.</p>",
      "<p>Second, the barrier blocks any attempt to possess the warded creature (by a magic jar attack, for example) or to exercise mental control over the creature (including charm spells or effects). The protection does not prevent such effects from targeting the protected creature, but it suppresses the effect for the duration of the protection from undead spell. If the protection from undead effect ends before the effect granting control does, the would-be controller would then be able to command the controlled creature. Likewise, the barrier keeps out a possessing life force but does not expel one if it is in place before the spell is cast.</p>",
      "<p>Third, the spell prevents bodily contact by summoned creatures (regardless of whether they are undead or not). This causes the natural weapon attacks of such creatures to fail and the creatures to recoil if such attacks require touching the warded creature. The protection against contact by summoned creatures ends if the warded creature makes an attack against or tries to force the barrier against the blocked creature.</p>",
      "<p>Reversed, this spell becomes quite potent as protection from living. It functions in all ways as described above, save that “living” creatures are kept away, rather than dead or “undead” creatures. Necromancers often use both versions of the spell to protect themselves from threats by both the living population as well as powerful undead that may try to command the Necromancer such as ghosts or vampires.</p>"
    ]
  },
  {
    "name": "Protection from Undead 10' Radius*",
    "range": "touch",
    "level": 3,
    "class": "Necromancer",
    "duration": "1 turn / level",
    "description": [
      "<p>This spell functions exactly as protection from undead, but with a 10-foot radius rather than 1. All within the radius receive the protection; those who leave and then re-enter, or who enter after the spell is cast, receive the protection as well.</p>",
      "<p>Reversed, this spell becomes protection from living 10' radius, and functions exactly as the reversed form of protection from undead, except that it covers a 10-foot radius around the target rather than 1.</p>"
    ]
  },
  {
    "range": "50'",
    "name": "Ray of Exhaustion",
    "duration": "6 rounds / level",
    "level": 3,
    "class": "Necromancer",
    "description": [
      "<p>The caster points a finger at their intended target and rolls a ranged attack roll against the target that ignores armor (but not any Dexterity bonus). If the narrow black ray hits, the target must save vs. Spells or suffer a -6 adjustment to its Strength and Dexterity for the duration of the spell. If the save is made, the reduction is only -2.</p>"
    ]
  },
  {
    "range": "touch",
    "name": "Re-Animation",
    "duration": "special",
    "level": 4,
    "class": "Necromancer",
    "description": [
      "<p>Virtually identical to the Cleric or Magic-User animate dead spell, this spell turns the bones or bodies of dead creatures into undead skeletons or zombies that follow the caster's spoken commands. They remain animated until they are destroyed. The Necromancer may animate a number of hit dice of undead equal to three times their caster level, and no more. Animated skeletons have hit dice equal to the number the creature had in life; for skeletons of humans or demi-humans, this means one hit die, regardless of the character level of the deceased. Zombies have one more hit die than the creature had in life. An animated skeleton can be created only from a mostly-intact skeleton; a zombie can be created only from a mostly-intact corpse. The caster must touch the remains to be animated. The caster may control no more hit dice of undead than 6 times their level.</p>"
    ]
  },
  {
    "range": "touch",
    "name": "Rot Flesh",
    "duration": "instantaneous",
    "level": 4,
    "class": "Necromancer",
    "description": [
      "<p>This spell works exactly like the decay flesh spell, save that it deals 2d6 points of damage plus 1 point per caster level to the creature affected by it. The caster must make a successful attack to inflict the damage. A missed attack roll does not dispel the effect, as it can be active until used or a number of rounds equal to the caster's level have passed.</p>",
      "<p>Just like the lower level decay flesh spell, this spell may not be reversed, and similarly, this spell works upon undead creatures in the opposite fashion; they are healed for 2d6 points plus 1 point per caster level worth of damage instead.</p>"
    ]
  },
  {
    "range": "special",
    "name": "Spirit Wrack",
    "duration": "instantaneous",
    "level": 3,
    "class": "Necromancer",
    "description": [
      "<p>This spell deals 1d8 points of damage per caster level to any one particular incorporeal undead being such as wraiths, spectres, ghosts, or similar entities within sight of the caster. Alternatively, the caster may choose to cause a burst of 1d4 points of damage per level to any such beings within 20 feet of the caster, whether visible or not. Minor spiritual beings such as poltergeists haunting an area are usually destroyed outright by this spell. Any affected being is allowed a save for half damage.</p>",
      "<p>Some persistent types of undead may reform after the passage of some time (typically days later), and may require certain rituals or other requirements be fulfilled before being permanently destroyed. This spell only affects true incorporeal undead and does nothing against other types of beings, even if they happen to be insubstantial at the time; vampires that happen to be in gaseous form are immune to this spell's effect.</p>"
    ]
  },
  {
    "range": "self",
    "name": "Stench",
    "duration": "1 turn / level",
    "level": 1,
    "class": "Necromancer",
    "description": [
      "<p>This spell creates a sickly stinking smell of rot and decay that emanates from the caster's body. The stench duplicates the sickening effect of ghasts (see its entry in the Basic Fantasy Field Guide Omnibus). The smell of death and corruption surrounding the caster is so overwhelming that living creatures within 10 feet must succeed a save vs. Poison or be sickened for 2d6 rounds (-2 to attack rolls). For every three levels the caster has, a penalty of ‑1 on the save is applied to those affected (at 3rd the save is at -1, at 6th level at -2, at 9th level at -3, etc). A creature that successfully saves cannot be affected again by this spell or a ghast’s stench for 24 hours. A neutralize poison spell removes the effect from a sickened creature.</p>"
    ]
  },
  {
    "range": "10' / level",
    "name": "Summon Spirit",
    "duration": "1 turn / level",
    "level": 3,
    "class": "Necromancer",
    "description": [
      "<p>Upon casting this spell, a malevolent spirit in the form of a wraith is called to serve the caster for 1 turn per level. If the caster is 10th level they may choose between 1d4 wraiths or one spectre. At 15th level the caster may opt to summon 2d4 wraiths, 1d3 spectres, or one ghost. The summoned spirits will serve according to its ability, usually by combating the caster's foes, and generally disappearing at the end of the spell's duration.</p>",
      "<p>Occasionally the spirit does not depart at the end of the spell duration, but simply becomes free of the compulsion to serve and will usually attack the caster. The chance is 5% for any particular wraith, 10% for spectres, and 20% for a ghost. When this occurs, the spirit will remain in the area for a number of rounds equal to the caster's level before departing. A spirit with less than half its hit points will not stay regardless. The caster would be wise to have protections or other contingencies against the rogue spirits.</p>"
    ]
  },
  {
    "range": "see text",
    "name": "Symbol of Fear",
    "duration": "see text",
    "level": 6,
    "class": "Necromancer",
    "description": [
      "<p>This spell functions like symbol of pain, except that all creatures within 60 feet of the symbol of fear become panicked for 1 round per caster level. A panicked creature will drop whatever it is holding and flee using any means necessary. If cornered, the creature will cower in fear. The victim will also suffer a -2 to all saving throws. The creature will do this for the duration of the spell. If a save is made, the victim is still shaken and suffers -2 to attack rolls and saving throws for 1 round.</p>"
    ]
  },
  {
    "range": "see text",
    "name": "Symbol of Pain",
    "duration": "see text",
    "level": 5,
    "class": "Necromancer",
    "description": [
      "<p>With this spell, the caster writes a potent rune on a surface. When triggered, each creature within 60 feet of the symbol of pain are wracked with pain. This pain imposes a -4 to all attack rolls, damage rolls, and saving throws. These effects last for as long as the creature stays within range of the symbol, and for 1 hour after leaving the area.</p>",
      "<p>Once triggered, the symbol will remain active for 1 turn per caster level. After that the symbol is discharged. A symbol is permanent until discharged; it may be removed by dispel magic that targets the rune specifically.</p>",
      "<p>The symbol is triggered by one or more of the following, as determined by the caster: a victim looks at the rune, reads the rune, touches the rune, or passes near the rune. Regardless of the triggering methods, it cannot be triggered by a creature more than 60 feet away. Once the spell is cast, the trigger methods cannot be changed.</p>",
      "<p>Triggering methods can be further modified by qualifiers, type of creature, race of creature, number of creatures, skip some number of triggers (so it is the third creature to touch it, not the first or second), or any other qualifier that is based on observable actions or details.</p>",
      "<p>The symbol may also be assigned a password that will temporarily disable the symbol when the password is said as a creature enters the range of the symbol. Each time the range is entered, the password must be said again or the symbol will go off. This is set at the time of casting and cannot be changed.</p>"
    ]
  },
  {
    "range": "touch",
    "name": "Undeath",
    "duration": "instantaneous",
    "level": 6,
    "class": "Necromancer",
    "description": [
      "<p>As a vile necromantic alternative to the reincarnation spell, this spell can be used to bring back individuals to the world of the living. Upon casting this spell, the caster brings back a dead character (or creature) in an undead state, whether as some sort of reanimated body or as spiritual or ghost-like form. Wicked, cruel, murderous, or so-called evil beings will often want to continue their predations in undeath, but for most beings the subject's soul is not willing to return in such a state. Most normal individuals roll a saving throw vs. Spells to avoid coming back (rolled as if they were still alive and well), and if successful the spell fails completely as the soul cannot be compelled to return.</p>",
      "<p>Roll on the following table to determine what sort of undead creature the character becomes. Entries marked with (FG) indicate creatures from the Basic Fantasy Field Guide Omnibus.</p>",
      "<table><tr><th><strong>d%</strong></th><th><strong>Undead Form</strong></th></tr><tr><td>01-25</td><td>Ghoul</td></tr><tr><td>26–40</td><td>Ghast (FG)</td></tr><tr><td>41-50</td><td>Mummy</td></tr><tr><td>51-55</td><td>Spectre</td></tr><tr><td>56-60</td><td>Vampire</td></tr><tr><td>61-75</td><td>Wight</td></tr><tr><td>76-84</td><td>Wraith</td></tr><tr><td>85-90</td><td>Ghost</td></tr><tr><td>91-00</td><td>Other (GM's choice)</td></tr></table>",
      "<p>Since the dead character is returning in a state of undeath, all physical ills and afflictions are generally irrelevant. The condition of the remains is not really a factor so long as the body is largely intact. The magic of the spell repairs or otherwise accommodates any changes necessary to conform to the new undead state, the process taking one hour to complete. When the spell is finished, the new undead being becomes aware and active. The caster has absolutely no special control over the newly-'risen' being. Of course, subsequent spells may be cast, having completely normal effects upon the new undead.</p>",
      "<p>The newly-undead character recalls the majority of its former life and form. Its class is unchanged, as are the character's Intelligence, Wisdom, and Charisma (but see below). The physical abilities of Strength, Dexterity, and Constitution should be re-rolled or determined by the parameters of the new form. The subject’s level (or Hit Dice) is reduced by 1; this is a real reduction, not a negative level, and is not subject to magical restoration. The subject of this spell takes on all the abilities, hindrances, and disadvantages of the new undead state, having either the undead creature's normal hit dice or will have hit points according to the character's reduced level, whichever is higher. In either case, the character's class abilities are available to the newly-risen form excepting any obviously contradicting situations. For instance, Climbing is probably of little importance to a ghost-like form.</p>",
      "<p>The spell can thus create generally-superior undead beings who often go on to lead others of their kind. The undead creature gains all abilities associated with its new form, including forms of movement and speeds, natural armor, natural attacks, extraordinary abilities, and the like, but also must confront any special tendencies of the new state. For instance, a newly-risen ghoul hungers voraciously for fetid flesh, and a new vampire thirsts for blood. The compulsions of the undead is very strong, and the behaviors will soon overcome any previous relationships with living beings, although it may experience remorse over killing its former friends. For undead such as ghouls, ghasts, wights, and similar beings, the urges to kill and feed are so strong that they can become effectively mindless (-6 to Intelligence and Wisdom scores) until the urges are temporarily satisfied. Vampires have a bit more conscious control over their hunger and do not have this penalty. For other types of undead not listed here, the GM may assign relevant behaviors that must be followed.</p>",
      "<p>Constructs, elementals, and similar creatures cannot become undead. The creature must have originally been a living corporeal being with some semblance of intelligence. The GM has the final say whether this spell affects any specific being. Likewise the GM decides any special situations or special manifestations that may occur from the use of this spell. Generally, any character who becomes an undead immediately becomes an NPC under the control of the GM unless he or she has made special accommodations to allow for undead player characters.</p>",
      "<p>Note: this spell is intended only for Necromancers, as the other spell-casting classes have access to similar types of spells (reincarnation and raise dead).</p>"
    ]
  },
  {
    "range": "240'",
    "name": "Undeath to Death",
    "duration": "instantaneous",
    "level": 6,
    "class": "Necromancer",
    "description": [
      "<p>This spell functions exactly as the death spell, except that it affects undead creatures rather than living creatures.</p>"
    ]
  },
  {
    "range": "touch",
    "name": "Vampiric Touch",
    "duration": "1 round / level",
    "level": 3,
    "class": "Necromancer",
    "description": [
      "<p>The caster must make an attack roll. If successful, the caster deals 1d6 points of damage per two caster levels. The caster gains temporary hit points equal to the damage dealt. If the attack kills the target, the caster only gains as many temporary hit points as it took to kill the target, not the full number rolled. The temporary hit points will last for 1 hour.</p>"
    ]
  },
  {
    "range": "10' / level",
    "name": "Wall of Bones",
    "duration": "1 round / level",
    "level": 4,
    "class": "Necromancer",
    "description": [
      "<p>An immobile wall of writhing interlocking bone and bone fragments rises from the earth. The wall is composed of up to one 10- x 10-foot square section, 1 foot thick, per caster level. Unlike the similar spell, wall of stone, the caster may not double the wall’s area by halving its thickness, as the structure is already very porous and would lose its structural integrity, but of course the wall can be made thicker. For instance, a 10th-level caster could conjure a section to fill in a 10-foot cube (10 feet x 10 feet x 1 foot, 10 sections thick). The wall cannot be conjured so that it occupies the same space as a creature or another object. The wall does not require concentration to maintain, but falls to pieces at the end of the spell duration.</p>",
      "<p>The spell also differs from the wall of stone spell in that the semi-animated wall attacks those within close proximity to its structure (10 feet) for 2d4 points of piercing and slashing damage from the bones. The structure is not completely solid, so high-strength individuals may attempt to break through with a Strength check, but they take an additional 2d6+1/level points of damage while making the attempt for each 1 foot of thickness that they attempt to move through. A separate Strength check is necessary for each 1 foot of thickness of the wall section in order to break through. The bone wall does not attack the caster or any undead creatures. The wall of bones may be fashioned into simple structures such as ramps or bridges to span a rift, but these uses reduce the size by half so that supporting arches or buttresses can be included.</p>"
    ]
  },
  {
    "range": "30'",
    "name": "Waves of Fatigue",
    "duration": "1 turn / level",
    "level": 5,
    "class": "Necromancer",
    "description": [
      "<p>This spell sends an invisible wave of harmful energy out forward of the caster to a range of 30 feet. All living creatures in the area suffer a -2 adjustment to their Strength and Dexterity for the duration of the spell.</p>"
    ]
  }
]